##Function String
#___.stratswith(___) ----> ใช้ตรวจสอบคำขึ้นต้น ว่า เป็นอะไร,เป็นจริงมั้ย เช่นนนน
# name = input("กรุณรากรอกชื่อของคุณ : ")
# if name.startswith("นาย"):
#     print("เป็นเพศชาย")
# else:
#     print("เป็นเพศหญิง")
#---------------------------------------------------------------------------

#___.endswith(___) ----> ใช้ตรวจสอบคำลงท้าย ว่า เป็นอะไร,เป็นจริงมั้ย เช่นนนน
# month = input("กรุณากรอกเดือน : ")
# if month.endswith("คม"):
#     print("มี 31 วัน")
# else:
#     print("มี 30 วัน")
#---------------------------------------------------------------------------

#___.find(___) ----> ใช้ค้นหาคำว่า มีอยู่ในตัวแปรหรือไม่ เช่นนนน
# txt = "Hello Python"
# print(txt.find("Python")) 
#มี และเริ่มต้นมี่ตัวที่ 6 นับจาก 0 
#ถ้าค้นเจอจะเป็นเลข INDEX ค่าบวกเลย แต่ถ้ามไ่ม่เจอ จะเป็นค่าติดลบ
#___.count(___) ----> ใช้นับว่าตัวอักษรที่กำหนดนั้น นับแล้วมีกี่ตัว
#___.replace(___, ___) ----> ใช้ต้องวการระบุข้อมูที่ต้องการนจะแทนที่ ง่ายๆก็คือ การจะแทนที่ตัวไหนด้วยคำไหน
#len(___) ----> คือการดูจำนวนตัวอักษร ว่ามีกี่ตัว นับช่องว่างด้วย
#___ = "___".strip() ----> คือการลบช่องว่าง
#---------------------------------------------------------------------------

##Function List
#___.append(___) ----> เพิ่มข้อมูล 1 ข้อมูล ต่อท้ายข้อมูลเดิม
#___.extend([___]) ----> เพิ่มข้อมูลหลายข้อมูล ต่อท้ายข้อมูเดิม
#___insert(index, ___) ----> แทรกข้อมูลใหม่ ตาม index ที่ต้องการ
#___.clear(___) ----> ลบสมาชิกทั้งหมดออกจาก list
#___.remove(___) ----> ลบสมาชิกที่ระบุออกจาก list
#___count(___) ----> นับข้อมูลซ้ำกันว่ามีกี่จำนวน
#___.sort() ----> เรียงลำดับสมาชิก
#___.reverse() ---->  เรียงลำดับสมาชิกแบบย้อนกลับ
#___.pop(index) ----> ลบข้อมูลภายในลิส แล้วก็จะคืนค่าที่ลบกลับมา ถ้าไม่ได้ระบุตำแหน่ง มันก็จะคืนค่าตัวสุดท้ายกลับมา
#print(sorted(___)) ----> เรียงลำดับ ตอนปริ้นเลย จะได้ประหยัดพื้นที่โค้ด
#---------------------------------------------------------------------------

##Function Set
#___.add(___) ----> แอดเข้าเพิ่ม 1 รายการ
#___.update((___,___)) ----> เพิ่มข้อมูลมากกว่า 1 รายการ
#___.union(___) ----> รวมเซตกัน
#___.intersection(___) ----> เอาข้อมูลเหมือนกันมาใช้
#___.difference(___) ----> เป็นการหาข้อมูที่มีอยู่ใน เซตที่เราจะหา 
#---------------------------------------------------------------------------

##การเข้าถึงและเพิ่มข้อมูล Dictionary##
#___["___"] ----> ดึงข้อมูล
#___["___"] = ___ ----> แก้ไขข้อมูล
#___["new_key"] = ___ ----> เพิ่มข้อมูล
##Function Dictionary
#___.keys() ----> ดึง keys ทั้งหมดใน Dictionary มาใช้งาน
#___.values() ----> ดึง values ทั้งหมดใน Dictionary มาใช้งาน
#___.get(key) ----> ดึงข้อมูลใน Dictionary ตาม key ที่ระบุ
#___.items() ----> ดึงข้อมูล keys และ values ทั้งหมด 
#___.clear() ----> ลบสมาชิกทั้งหมดออกจาก Dictionary
#___.pop(key) ----> ลบข้อมูลใน Dictionary ตาม key ที่ระบุ
#___.update({key,value}) ----> เพิ่มหรืออัพเดตข้อมูลใน Dictionary